---
layout: post
status: publish
published: true
title: Relacja z Code Europe
author:
  display_name: wpiot
  login: wpiot
  email: wojciech.piotrowiak+wordpress@gmail.com
  url: ''
author_login: wpiot
author_email: wojciech.piotrowiak+wordpress@gmail.com
wordpress_id: 118
wordpress_url: https://www.wojciechpiotrowiak.eu/?p=118
date: '2017-12-07 21:05:19 +0100'
date_gmt: '2017-12-07 21:05:19 +0100'
categories:
- relacje
tags: []
---
<p>Ostatni wtorek spędziłem w Krakowie na konferencji Code Europe. Zapraszam na relację, najpierw opiszę ścieżkę kt&oacute;rą wybrałem, potem kr&oacute;tki opis całego otoczenia.</p>
<p>Każdy blok był ciężkim wyborem, bo było aż siedem wykład&oacute;w w tym samym czasie. Na początek wybrałem <strong>'Secrets of the Above Average Programmers'</strong>. Pouczający wykład, dwie gł&oacute;wne kwestie kt&oacute;re zapamiętałem to warto mieć hobby poza IT na wypadek utraty pracy oraz&nbsp; być świadomym swojej ignorancji w tematach, kt&oacute;re nie są na bliskie. Całość wykładu była wzbogacona nagraniami audio ze znanym programistami i ludźmi z całej branży IT.</p>
<p>Po kt&oacute;tkiej przerwie (mniej niz 15 minut)wybrałem<strong> 'Introduction to Blockchain technology'. </strong>Był to ciężki wyb&oacute;r, bo z jednej strony na ten temat jest sporo informacji, lecz temat jest tak dynamiczny, że zdecydowałem się na wysłuchanie najnowszych informacji i nie zawiodłem się. Prezenter om&oacute;wił zar&oacute;wno bitcoin jak i Ethereum oraz ciekawe zastosowania kryptowalut w praktyce. Patrząc na agendę ten temat był dominujący wśr&oacute;d innych.</p>
<p>Kolejny blok i tym razem<strong> 'Agile integration with Apache Camel microservices on Kubernetes'. </strong>Na plus dobre przygotowanie prezentera, krok po kroku pełne wytłumaczenie idei i sporo przykład&oacute;w na żywo. Mn&oacute;stwo użytecznych rozwiązań jak skalowanie w g&oacute;rę i d&oacute;ł, ożywianie zaginionych zadań, dzielenie ruchu, szybki deployment kodu oraz możliwość prostych test&oacute;w wielu zadań nawet na laptopie.</p>
<p>Następny wyb&oacute;r padł na <strong>'Jak zbudować skalowalne środowisko testowe'. </strong>Interesująca koncepcja tworzenia test&oacute;w poprzez kreację akcji opartych na wzorcu builder, kt&oacute;ry tworząc prosty DSL ułatwia konstrukcję dobrze opisanych scenariuszy testowych.</p>
<p>Kolejny wykład to<strong> 'What is LOP and devbus and why should you care?'. </strong>LOP oznacza Language Oriented Programming i w tej chwili stanowi niejako rozszerzenie DDD czyli projektowanie domenowe. Prezenter jest CEO firmy, kt&oacute;ra stosuje tą technikę na co dzień w praktyce z klientami. Gł&oacute;wne założenie to tworzenie język&oacute;w programowania (tak na prawdę jest to bardziej warstwa abstrakcji w językach jak scala, groovy niż język od podstaw)&nbsp; kt&oacute;re opisują domenę lepiej niż tradycyjne języki jak np. Java. Wiąże się to z większym nakładem pracy na sam język jednak jego użycie zdecydowanie zmniejsza ilość kodu (a więc i błęd&oacute;w). W wyniku takiej pracy rezultat jest tak naprawdę dokumentacją, testami i kodem jednocześnie. Dzięki użyciu tych technik kod jest bardziej czytelny, co umożliwia wsp&oacute;lną pracę programist&oacute;w i biznesu.</p>
<p>Następne 50 minut postanowiłem spędzić na prezentacji<strong> 'NeuroJavaScript: Interacting with Brain-Computer Interfaces'. </strong>Temat tak zaciekawił uczestnik&oacute;w, że wypełnili największą z sal do pełna (we wtorek była to sala teatralna, największa sala w ICE nie została użyta). Prezenter w przystępny spos&oacute;b wprowadził nas w tematykę fal m&oacute;zgowych, następnie przedstawił aktualną sytuację w tej dziedzinie. Gł&oacute;wnym punktem była prezentacja dw&oacute;ch urządzeń na żywo z udziałem publiczności, polegała ona na odczycie fal m&oacute;zgowych, kt&oacute;re automatycznie były prezentowane w przeglądarce. Na plus dobre przygotowanie i&nbsp; umiejętności prezentacyjne, była to jedna z ciekawszych prelekcji.</p>
<p>Kolejny blok spędziłem z <strong>'Reactive Data-Analysis with Vert.X'.&nbsp;</strong>O Vert.X słyszałem sporo już dużo wcześniej, więc zdecydowałem się na pozyskanie dodatkowych informacji. Vert.X jest technologią opartą na event bus, umożliwia pisanie mikroserwis&oacute;w w oparciu o r&oacute;żne technologie (java, js) i uruchamianie ich na jednym komputerze. Prezentacja pokazywała proces tworzenia konektora danych pomiędzy grafaną a mongoDB. Technologia wzbudziła moje zainteresowanie, bardzo dobrze przygotowania prezentacja.</p>
<p>Następny i ostatni wyb&oacute;r padł na <strong>'Real-life Hacking Stories' </strong>, prowadzący w przewrotny i zabawny spos&oacute;b przekazał kilka prawdziwych sytuacji, w kt&oacute;rych może znaleźć się każdy z nas kto podczas releasu. Prezenter symulował typowego programistę kt&oacute;ry wątpi w to, że ktoś może się włamać do naszej aplikacji, a następnie tłumaczył dlaczego &oacute;w programista nie ma racji, a nasza aplikacja ma podatności. Bardzo ciekawe przykłady jak w systemach tworzą się podatności pomimo tego, że nasz własny kod jest w pełni bezpieczny. Jeden z przykład&oacute;w dotyczych ataku na GitHub (w ramach bug bounty, więc obyło się bez ofiar) w kt&oacute;rym połączono aż cztery! podatności, kt&oacute;re nie wynikały bezpośrednio z kodu. O przykładzie można poczytać tu: <a href="http://blog.orange.tw/2017/07/how-i-chained-4-vulnerabilities-on.html">http://blog.orange.tw/2017/07/how-i-chained-4-vulnerabilities-on.html</a></p>
<p>Była jeszcze jedna porcja prezentacji, jednak z braku czasu musiałem już opuścić konferencję. Poza prezentacjami była też duża ilość stanowisk firm sponsorskich w ramach 'breloczek za cv' :) Jedno z wyr&oacute;żniających się stoisk należało do firmy TomTom:</p>
<p><img class="aligncenter size-large wp-image-123" src="https://www.wojciechpiotrowiak.eu/wp-content/uploads/2017/12/0ADA08F7-3B7B-4350-A9DD-6A7E70D745CB-1024x768.jpg" alt="" width="840" height="630" /></p>
<p>Można było porozmawiać o skanowaniu dr&oacute;g z kierowcą takiego wozu (ponad 100k km rocznie!) jak r&oacute;wnież jak i o samej nawigacji. Firma przygotowała też kilka wykład&oacute;w na temat ich technologii. Gratuluje pomysłu i realizacji:)</p>
<p>Całość konferencji odbyła się w budynku ICE, w kt&oacute;rym miałem już przyjemność przebywać podczas dw&oacute;ch edycji Devoxxa. Tym razem organizator nie zdecydował się na otwarcie największej sali, zamiast tego zostały wykorzystane mniejsze sale jak i wykorzystana przestrzeń w przejściach. Pomimo mniejszej frekwencji niż na Devoxxie na kilku prelekcjach było tłoczno, a sale zapełniały się w pełni. Myślę, że cena (bilety można było kupić już za kilkadziesiąt złotych) odpowiadała ofercie dla uczestnik&oacute;w tzn. skromny zestaw powitalny, nie było cateringu ani napoj&oacute;w. Tak jak już wspomniałem siedem ścieżek (devoxx w tym roku miał pięć) to trochę sporo, tak samo mam zastrzeżenia co do zbyt kr&oacute;tkich przerw jak, długiego czasu rejestracji na miejscu jak i moim zdaniem niepotrzebnego skanowania identyfikator&oacute;w przed wejściem na sale.</p>
<p>Podsumowując jestem zadowolony, myślę, że jeśli ktoś nie ma aż trzech dni na tak duże konferencje jak Geecon lub Devoxx to może być to dobra alternatywa.</p>
<p><img class="aligncenter size-large wp-image-128" src="https://www.wojciechpiotrowiak.eu/wp-content/uploads/2017/12/badge-1-768x1024.jpg" alt="" width="768" height="1024" /></p>
