---
layout: post
status: publish
published: true
title: Patenty cz.3
author:
  display_name: admin
  login: admin
  email: wojciech.piotrowiak@gmail.com
  url: ''
author_login: admin
author_email: wojciech.piotrowiak@gmail.com
wordpress_id: 104
wordpress_url: https://www.wojciechpiotrowiak.eu/?p=104
date: '2017-12-01 21:55:59 +0100'
date_gmt: '2017-12-01 21:55:59 +0100'
categories:
- patenty
tags: []
---
<p>Dziś o parametryzacji naszych program&oacute;w.</p>
<h1>Użyteczne parametry w Javie</h1>
<p>Na początku małe wyjaśnienie, wpis dotyczy nazwanych parametr&oacute;w Javy, a nie konkretnych wartości dla funkcji main (te moim zdaniem są mało użyteczne, poza samouczkami rzadko widziałem zastosowania w praktyce).&nbsp; Całość podzieliłem na kilka tematycznych sekcji:</p>
<h2>Bezpieczeństwo/połączenie sieciowe</h2>
<p>Kilka pomocnych parametr&oacute;w:</p>
<ul>
<li>Wszystkie błędy związane z siecią, ssl itp można wykryć łatwiej widząc więcej informacji w logach. Dzięki parametrowi:</li>
</ul>
<p><code>-Djavax.net.debug=all</code></p>
<p>mamy dostęp do znacznie większej ilości szczeg&oacute;ł&oacute;w.</p>
<ul>
<li>Wymuszenie konkretnej wersji TLS dla uruchamianego programu można zrobić tak:</li>
</ul>
<p><code>-Dhttps.protocols=TLSv1.1,TLSv1.2</code>.</p>
<p>Nie jest najbardziej eleganckie rozwiązanie (Podobne ustawienie można ustawić na poziomie systemu operacyjnego, lub całego JRE), natomiast niekiedy nie ma innego wyjścia.</p>
<ul>
<li>Wybranie konkretnej wersji IP. Podobnie jak wyżej nie jest to zalecane rozwiązanie, ale na czas debugowania, można wymusić wersję czwartą:</li>
</ul>
<p><code>-Djava.net.preferIPv4Stack=true</code></p>
<p>lub sz&oacute;stą</p>
<p><code>-Djava.net.preferIPv6Stack=true</code></p>
<h2>Parametry związane z wydajnością</h2>
<p>W tym temacie większość os&oacute;b kojarzy gł&oacute;wnie wartości pamięci RAM kt&oacute;re chcemy przydzielić dla konkretnego programu. Niestety ta wiedza szybko umyka, bo nadal sporo aplikacji 'wita' się następującym logiem:</p>
<pre class="lang-java prettyprint prettyprinted"><code><span class="typ">Java</span> <span class="typ">HotSpot</span><span class="pun">(</span><span class="pln">TM</span><span class="pun">)</span> <span class="lit">64</span><span class="pun">-</span><span class="typ">Bit</span> <span class="typ">Server</span><span class="pln"> VM warning</span><span class="pun">:</span><span class="pln"> ignoring option </span><span class="typ">MaxPermSize</span><span class="pun">=</span><span class="lit">128M</span><span class="pun">;</span><span class="pln"> support was removed in </span><span class="lit">8.0</span><span class="pln">
java version </span><span class="str">"1.8.0_25"</span></code></pre>
<p>Wiąże się to z faktem, że dane przechowywane w PermGeneration w Javie 8 zostały przeniesione ze sterty do pamięci natywnej. Najwyraźniej, aplikacja została napisana jakiś czas temu i nie zmodyfikowano parametr&oacute;w. Dla zapominalskich polecam generator parametr&oacute;w online: <a href="http://jvmmemory.com/">http://jvmmemory.com/</a></p>
<p>Opr&oacute;cz pamięci istnieje cała masa parametr&oacute;w wymuszających użycie konkretnego garbage collectora jak i jego konfiguracje, do tego specyfikacje co należy logować, co zrobić w przypadku OutOfMemoryException i gdzie zrzucić HeadDump.</p>
<p>Praktycznie każda pr&oacute;ba poprawy wydajności kończy się dodaniem takiego parametru, dotychczas wszystkie aplikacje produkcyjne jakie widziałem z czasem obrastają takimi parametrami.</p>
<h2>Parametry na żądanie</h2>
<p>Całe JDK/JRE zawiera gigantyczną ilość parametr&oacute;w, kt&oacute;ra zwiększa się przy każdej wersji. Jako programiści r&oacute;wnież mamy możliwość by w ramach naszej aplikacji stworzyć własne parametry.</p>
<p>Od strony kodu wystarczy pobrać nowy parametr poprzez konstrukcję:</p>
<pre>System.getProperty("parametr");</pre>
<p>Zwracana wartość to String, opr&oacute;cz tego istnieje możliwość przekazania wartości defaultowej jako drugi parametr (r&oacute;wnież String).</p>
<p>Ustawienie wartości tworzy się poprzez dodanie argumentu wywołania programu: -Dparametr="test" dla tekstowych wartości lub&nbsp; -Dparametr=23 dla np numerycznych</p>
<p>Przekazywanie wielu parametr&oacute;w w ten spos&oacute;b może nie być najwygodniejsze, dlatego dla większej ilości parametr&oacute;w lepiej użyć plik&oacute;w Properties jako komponentu Javy.</p>
<p>Opr&oacute;cz ustawiania parametr&oacute;w przez linię poleceń istnieje też możliwość ustawienia poprzez kod:</p>
<pre>System.setProperty("user.timezone", "EST");</pre>
<h2>Parametry związane lokalnym systemem/użytkownikiem</h2>
<p>Opr&oacute;cz ściśle technicznych kwestii, parametry mogą nam pom&oacute;c sterować zmiennymi, kt&oacute;re nie są zapisane w kodzie, ale mają wpływ na jego zachowanie. Do takich zmiennych zaliczają się między innymi:</p>
<ul>
<li><strong>user.dir</strong> - ściezka robocza użytkownika</li>
<li><strong>user.home</strong> - katalog domowy użytkownika</li>
<li><strong>user.name</strong> - nazwa użytkownika</li>
<li><strong>user.timezone</strong> - strefa czasowa użytkownika</li>
</ul>
<p>Większość już zdefiniowanych parametr&oacute;w można nadpisać, co może nam pom&oacute;c uruchomić specyficzne (czytaj źle napisane) zestawy test&oacute;w lub biblioteki.</p>
<h2>Parametry a zmienne systemowe</h2>
<p>Z poziomu aplikacji mamy dostęp do systemowych zmiennych takich jak użytkownik, ścieżki. Tak więc jeśli w linuxie w terminalu wpiszemy:</p>
<p>echo $USER<br />
To identyczny wynik otrzymamy w Javie za pomocą:</p>
<pre>System.out.println(System.getenv("USER"));</pre>
<p>Tradycyjnie zapraszam na mojego githuba: <a href="https://github.com/wojciech-piotrowiak/patenty">https://github.com/wojciech-piotrowiak/patenty</a> , ten wpis r&oacute;wnież posiada wspomniane kawałki kodu w githubie.</p>
<p>To tyle na dziś, w przyszłym tygodniu wybieram się na konferencję Code Europe do Krakowa, obiecuję relację.</p>
