---
layout: revision
status: inherit
published: false
title: OCJP - opis przygotowań + relacja
author:
  display_name: wpiot
  login: wpiot
  email: wojciech.piotrowiak+wordpress@gmail.com
  url: ''
author_login: wpiot
author_email: wojciech.piotrowiak+wordpress@gmail.com
wordpress_id: 134
wordpress_url: https://www.wojciechpiotrowiak.eu/132-revision-v1/
date: '2017-12-30 21:56:31 +0100'
date_gmt: '2017-12-30 21:56:31 +0100'
categories: []
tags: []
---
<p>Egzamin <strong>OCJP</strong> zdałem pomyślnie w lutym tego roku, a do tego czasu nie udało mi się zabrać do relacji z tego wydarzenia na blogu. Jeśli chcesz się dowiedzieć w jaki spos&oacute;b przygotowałem się do tego egzaminu to zapraszam do lektury.</p>
<p>Egzamin <strong>OCJP</strong> oznacza Oracle Certified Java Programmer i jest 'spadkobiercą' kultowego <strong>SCJP</strong> czyli Sun Certified Java Programmer. Każda wersja Javy ma odzwierciedlenie w kolejnym egzaminie, a gotowy egzamin pojawia się kilka miesięcy po releasie Javy. Od wersji 7 egzamin został podzielony na dwie części- <b>Associate i Programmer.</b> By m&oacute;c podejść do poziomu Programmer należy zdać wcześniej Associate. Jeśli posiadacie już egzamin OCJP lub SCJP to Oracle przewidział możliwość egzamin&oacute;w kt&oacute;re sprawdzają r&oacute;żnicę między wersjami: <a href="http://education.oracle.com/pls/web_prod-plq-dad/db_pages.getpage?page_id=652&amp;get_params=p_exam_id:1Z0-813" target="_blank" rel="noopener">LINK</a></p>
<p>Według mojej opinii na temat egzamin&oacute;w tego typu to warto o ile mamy wystarczająco dużo czasu i samozaparcia, a jeśli do tego pracodawca wspiera nasz rozw&oacute;j pokrywając część koszt&oacute;w to zdecydowanie jest to opłacalne.</p>
<p>Ten egzamin należy do kategorii ciężkiej i zdanie go automatycznie pokazuje, że ktoś poświęcił co najmniej kilkadziesiąt godzin efektywnej pracy na przygotowania i podczas egzaminu w stresie był w stanie przeanalizować dużo informacji/kodu w kr&oacute;tkim czasie. Egzamin jest dostępny jedynie w języku Angielskim i Japońskim. Kr&oacute;tki czas oznacza dokładnie 150 minut, 85 pytań oraz pr&oacute;g 65% więc na każde z pytań mamy średnio 105 sekund, by zdać trzeba odpowiedzieć na 56 pytań.</p>
<p>Moim gł&oacute;wnym 'narzędziem' nauki&nbsp; była książka: <a href="https://www.selikoff.net/java-ocp-8-programmer-ii-study-guide/" target="_blank" rel="noopener">https://www.selikoff.net/java-ocp-8-programmer-ii-study-guide/</a></p>
<p>Zawiera komplet informacji oraz przykładowe pytania i 3 pr&oacute;bne egzaminy, jest polecana przez wielu innych programist&oacute;w. Książka tych samych autor&oacute;w pomogła mi r&oacute;wnież z egzaminem OCA. Ta pozycja pojawiła się jako pierwsza na rynku co niestety przełożyło się na sporą listę liter&oacute;wek i błęd&oacute;w, w tej chwili ponad 600! Pytania pr&oacute;bne i egzaminy są wymagające co moim zdaniem jest dobre bo nauka nie daje szybkiego poczucia, że 'już się umie' a człowiek nabiera respektu przed egzaminem.</p>
<p>Opr&oacute;cz tego z czystym sumieniem mogę polecić: <a href="http://ocpj8.javastudyguide.com/" target="_blank" rel="noopener">http://ocpj8.javastudyguide.com/</a> ponieważ jest na bieżąco poprawiana przez społeczność z całego świata, bardziej odpowiadała mi także struktura materiału i ciekawe pytania testowe.</p>
<p>Opr&oacute;cz wyżej wymienionych materiał&oacute;w polecam pisanie własnego kodu, dzięki temu budujemy 'pamięć mięśniową' w palcach i będzie nam łatwiej rozpoznać program na egzaminie gdy IDE już nie pomoże :) Trochę moich wypocin udało można zobaczyć tutaj: <a href="https://github.com/wojciech-piotrowiak/ocp_main" target="_blank" rel="noopener">https://github.com/wojciech-piotrowiak/ocp_main&nbsp;</a>Od razu chciałbym skomentować, że nie planowałem tworzyć z nich profesjonalnych materiał&oacute;w do nauki :P</p>
<p>Ostatni element to oczywiście własne notatki, myślę, że ich ilość była por&oacute;wnywalna z notatkami pod sesję egzaminacyjną na studiach :) Polecam spr&oacute;bować rysować własne 'mapy myśli': <a href="https://pl.wikipedia.org/wiki/Mapa_my%C5%9Bli" target="_blank" rel="noopener">https://pl.wikipedia.org/wiki/Mapa_my%C5%9Bli</a></p>
<p>Co do samego egzaminu to warto popytać znajomych i wybrać komfortowe miejsce, z dobrym dojazdem. Zdecydowanie należy się wyspać, spokojnie obliczyć czas na dojazd, zjeść dobre śniadanie itp. Moja strategia na sam egzamin to szybkie przejście przez całość i zaznaczanie 'pewniak&oacute;w' a następnie głębsza analiza trudniejszych pytań. Dzięki temu sytuacja, że czas po prostu się skończy jest niewielka, dodatkowo jako ostateczność można zastosować strzały na oślep, ponieważ nie ma ujemnych punkt&oacute;w za błędne odpowiedzi. Wszystkie szczeg&oacute;ły odnośnie egzaminu są dostępne online: <a href="https://wsr.pearsonvue.com/testtaker/registration/ExamPoliciesPage/ORACLE?conversationId=1513065" target="_blank" rel="noopener">https://wsr.pearsonvue.com/testtaker/registration/ExamPoliciesPage/ORACLE?conversationId=1513065</a></p>
<p>Oferta centr&oacute;w egzaminacyjnych jest duża, tak samo jak warunki w nich panujące. Datę, miejsce i godzinę egzaminu można przełożyć, ja zrobiłem to aż trzy razy...&nbsp; nic to nie kosztuje, a szkoda straconych pieniędzy jeśli nie czujemy się pewni.</p>
<p>Na koniec życzę wszystkim dobrych wynik&oacute;w i wszystkiego dobrego w nowym 2018 roku!</p>
<p>&nbsp;</p>
