---
layout: post
status: publish
published: true
title: Relacja z 4Developers Katowice
author:
  display_name: wpiot
  login: wpiot
  email: wojciech.piotrowiak+wordpress@gmail.com
  url: ''
author_login: wpiot
author_email: wojciech.piotrowiak+wordpress@gmail.com
wordpress_id: 236
wordpress_url: https://www.wojciechpiotrowiak.eu/?p=236
date: '2018-11-06 19:32:48 +0100'
date_gmt: '2018-11-06 19:32:48 +0100'
categories:
- relacje
tags: []
---
<p>Dziś (6 listopada) w Katowicach odbyła się pierwsza śląska edycja konferencji 4Developers, zapraszam do relacji.</p>
<p><img class="aligncenter size-large wp-image-241" src="https://www.wojciechpiotrowiak.eu/wp-content/uploads/2018/11/logo-768x1024.jpg" alt="" width="768" height="1024" /></p>
<p>Wszystkie wykłady odbywały się w hotelu novotel, a tematy zostały podzielone na 4 tematyki: Data Science, JS, Java i .net. Poranna rejestracja na wydarzenie przebiegła wyjątkowo sprawnie, już po kilku minutach, można było przygotować się przy kawie i ciastku.</p>
<p><img class="aligncenter size-large wp-image-240" src="https://www.wojciechpiotrowiak.eu/wp-content/uploads/2018/11/IMG-3115-1024x768.jpg" alt="" width="840" height="630" /><img class="aligncenter size-large wp-image-242" src="https://www.wojciechpiotrowiak.eu/wp-content/uploads/2018/11/IMG-3117-1-768x1024.jpg" alt="" width="768" height="1024" /></p>
<p>Będąc szczerym, pierwszy wykład pt. "<strong>Java 10 &ndash; (nie do końca) nowość w krainie Javy</strong>" początkowo nie wzbudził entuzjazmu, bo temat wydawał się już wyczerpany, ponadto mamy już JDK11. Mimo to prezentacja zrobiła na mnie dobre wrażenie, prezenter <strong>Marcin Chrost</strong> był dobrze przygotowany, a wiele wiadomości opierało się o praktyczne doświadczenie poparte przykładami w kodzie. Opr&oacute;cz samych zmian w JDK10, om&oacute;wione zostały zmiany w procesie releasowania oraz udoskonalenia, kt&oacute;re pojawią się w przyszłości.</p>
<p>Kolejny wykład "<strong>Scaled Retrospective &ndash; improvements bigger than a Scrum Team [ENG]</strong>" odpuściłem ze względu na zbyt 'miękką' tematykę , więc pozostały czas wykorzystałem na networking i wizytę na stanowiskach partner&oacute;w czyli: Epam,Groupon, Future Processing i Accenture. Odwiedziłem r&oacute;wnież stanowisko Proidea, na kt&oacute;rym można było wygrać wejści&oacute;wkę na Hackathlon "Hack yeah" w Warszawie (wejści&oacute;wka w postaci nalewki :)</p>
<p><img class="aligncenter size-large wp-image-237" src="https://www.wojciechpiotrowiak.eu/wp-content/uploads/2018/11/unnamed-768x1024.jpg" alt="" width="768" height="1024" /></p>
<p>Następne dwie prelekcje były poświecone GraphQL - "<strong>GraphQL - when REST API is not enough - lessons learned</strong>". Tematyka bardzo mi się spodobała, jest to alternatywa dla REST, kt&oacute;ra jako projekt została opublikowana przez Facebooka. Jest to technologia niezależna od protokołu http, umożliwiająca bardzo precyzyjne pobieranie i edycję danych. Prowadzący <strong>Marcin Stachniuk</strong> pokazał wiele przykład&oacute;w na żywo, om&oacute;wił za i przeciw oraz opisał dlaczego właśnie takie rozwiązanie sprawdziło się jego projekcie.</p>
<p>Kolejna prezentacja dotyczyła Domain Driven Design- "<strong>Secure Domain</strong>". Co prawda z początku było trochę problem&oacute;w technicznych, lecz reszta była na naprawdę wysokim poziomie. Prowadzący <strong>Dominik Przybysz</strong> zaczął od om&oacute;wienia architektury heksagonalnej i wewnętrznej domeny po czym przeszedł do przykład&oacute;w. Wszystkie przypadki zostały podzielone na obszary i opierały się na rzeczywiste sytuacje z projekt&oacute;w. Wykład nie opierał się tylko na Javie, można było zobaczyć sporo kodu z Kotlina, Scali i Grooviego. Z ciekawostek pierwszy raz zobaczyłem testy architektoniczne z użyciem <strong>ArchUnit.</strong></p>
<p>Następny wykład "<strong>Don&rsquo;t change project, change your project</strong>" autorstwa <strong>Adam Kulawika</strong> i<strong> Marcina Jasińskiego </strong>z początku wydał mi się kolejnym wykładem w kt&oacute;rym usłyszę, że ciągły refaktoring to m&oacute;j obowiązek i w sumie to wina programist&oacute;w, że piszą słaby kod. Okazało się zupełnie inaczej, prezentacja dotyczy opisu projektu w firmie Vatenfall, kt&oacute;ry umożliwia ładowanie samochod&oacute;w elektrycznych w kilku europejskich krajach. Poprzez wiele błędnych decyzji menadżerskich popadł projekt w zupełny chaos a następnie dzięki aż trzem audytom kodu i wsparciu firmy zewnętrznej udało się uratować projekt. Wykład spodobał mi się ze względu na to, że nie zawsze zdarza się, by firmy potrafiły się otwarcie przyznać do błęd&oacute;w a w szczeg&oacute;lności tych w zarządzaniu projektem.</p>
<p>Był to ostatni wykład w kt&oacute;rym mogłem uczestniczyć, opr&oacute;cz tego w ścieżce Java był jeszcze wykład autorstwa <strong>Bartka Kuczyńskiego </strong>kt&oacute;ry dotyczył projektu <strong>JLupin. </strong></p>
<p>Podsumowując było warto, na konferencji uczestniczyło 350 os&oacute;b czyli maksimum kt&oacute;re m&oacute;gł obsłużyć hotel. Mam nadzieję, że Śląska edycja 4Developers powr&oacute;ci do Katowic w nowym, większym miejscu.</p>
